app/views/gastos/_form.html.erb

    <%= form.label :tipo_gasto_id %>
    <%= form.select :tipo_gasto_id, options_from_collection_for_select(TipoGasto.all, :id, :descricao) %>
---
SELECT "tipo_gastos".* FROM "tipo_gastos"