app/controllers/gastos_controller.rb

  def index
    @gastos = Gasto.order(dtgasto: :desc)
---
SELECT "gastos".* FROM "gastos" ORDER BY "gastos"."dtgasto" ASC, "gastos"."desc" ASC

  def create
    @gasto = Gasto.new(gasto_params)

    respond_to do |format|
      if @gasto.save
---
INSERT INTO "gastos" ("dtgasto", "tipo_gasto_id", "valor", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["dtgasto", "2018-01-01"], ["tipo_gasto_id", 1], ["valor", 10.0], ["created_at", "2018-01-23 13:27:39.044941"], ["updated_at", "2018-01-23 13:27:39.044941"]]

  def update
    respond_to do |format|
      if @gasto.update(gasto_params)
---
UPDATE "gastos" SET "dtgasto" = ?, "tipo_gasto_id" = ?, "updated_at" = ? WHERE "gastos"."id" = ?  [["dtgasto", "2018-01-01"], ["tipo_gasto_id", 1], ["updated_at", "2018-01-23 17:53:53.045423"], ["id", 4]]

  def destroy
    @gasto.destroy
---
DELETE FROM "gastos" WHERE "gastos"."id" = ?  [["id", 1]]

  def consulta_por_ano
    if params[:ano] != nil
      @tipogasto = TipoGasto.all
---
SELECT "tipo_gastos".* FROM "tipo_gastos"

    def set_gasto
      @gasto = Gasto.find(params[:id])
---
SELECT  "tipo_gastos".* FROM "tipo_gastos" WHERE "tipo_gastos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]