app/controllers/gastos_controller.rb

  def index
    @gastos = Gasto.all
---
SELECT "gastos".* FROM "gastos"