app/controllers/tipo_gastos_controller.rb

  def index
    @tipo_gastos = TipoGasto.all
---
SELECT "tipo_gastos".* FROM "tipo_gastos"

  def create
    @tipo_gasto = TipoGasto.new(tipo_gasto_params)

    respond_to do |format|
      if @tipo_gasto.save
---
INSERT INTO "tipo_gastos" ("descricao", "created_at", "updated_at") VALUES (?, ?, ?)  [["descricao", "Gasolina"], ["created_at", "2018-01-23 13:24:28.800677"], ["updated_at", "2018-01-23 13:24:28.800677"]]

    def set_tipo_gasto
      @tipo_gasto = TipoGasto.find(params[:id])
---
SELECT  "tipo_gastos".* FROM "tipo_gastos" WHERE "tipo_gastos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]